nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1152/wifi_examples/uart_wifi_bridge/pin_mux.c
/*
 * Copyright 2026 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v17.0
processor: MIMXRT1152xxxxx
package_id: MIMXRT1152XHM8B
mcu_data: ksdk2_0
processor_version: 0.0.0
pin_labels:
- {pin_num: T2, pin_signal: GPIO_EMC_B1_39, label: LED, identifier: LED_config;LED}
- {pin_num: F16, pin_signal: GPIO_DISP_B1_06, label: ETH0_TDATA3, identifier: ETH0_TDATA3}
- {pin_num: B20, pin_signal: GPIO_DISP_B1_07, label: ETH0_TDATA2, identifier: ETH0_TDATA2}
- {pin_num: A21, pin_signal: GPIO_DISP_B1_08, label: ETH0_TDATA1, identifier: ETH0_TDATA1}
- {pin_num: C19, pin_signal: GPIO_DISP_B1_09, label: ETH0_TDATA0, identifier: ETH0_TDATA0}
- {pin_num: H16, pin_signal: GPIO_DISP_B1_10, label: ETH0_TX_EN, identifier: ETH0_TX_EN}
- {pin_num: G16, pin_signal: GPIO_DISP_B1_11, label: ETH0_TX_CLK, identifier: ETH0_TX_CLK}
- {pin_num: V2, pin_signal: GPIO_EMC_B1_40, label: ENET_MDC, identifier: ENET_MDC}
- {pin_num: U3, pin_signal: GPIO_EMC_B1_41, label: ENET_MDIO, identifier: ENET_MDIO}
- {pin_num: AD4, pin_signal: GPIO_EMC_B2_07, label: ETH0_RDATA3, identifier: ETH0_RDATA3}
- {pin_num: G25, pin_signal: GPIO_SD_B2_04, label: ETH0_RDATA2, identifier: ETH0_RDATA2}
- {pin_num: F24, pin_signal: GPIO_SD_B2_03, label: ETH0_RDATA1, identifier: ETH0_RDATA1}
- {pin_num: L20, pin_signal: GPIO_SD_B2_02, label: ETH0_RDATA0, identifier: ETH0_RDATA0}
- {pin_num: K24, pin_signal: GPIO_SD_B2_00, label: ETH0_RX_EN, identifier: ETH0_RX_EN}
- {pin_num: J23, pin_signal: GPIO_SD_B2_01, label: ETH0_RX_CLK, identifier: ETH0_RX_CLK}
- {pin_num: R25, pin_signal: GPIO_AD_14, label: ETH0_INT_B, identifier: ETH0_INT_B}
- {pin_num: G11, pin_signal: GPIO_DISP_B2_11, label: ENET_QOS_INT_B, identifier: ENET_QOS_INT_B}
- {pin_num: A11, pin_signal: GPIO_DISP_B2_04, label: ENET_QOS_TXEN, identifier: ENET_QOS_TXEN}
- {pin_num: AE7, pin_signal: GPIO_EMC_B2_20, label: ENET_QOS_REF_CLK1, identifier: ENET_QOS_REF_CLK1}
- {pin_num: C15, pin_signal: GPIO_DISP_B2_02, label: ENET_QOS_TXD0, identifier: ENET_QOS_TXD0}
- {pin_num: F11, pin_signal: GPIO_DISP_B2_03, label: ENET_QOS_TXD1, identifier: ENET_QOS_TXD1}
- {pin_num: C9, pin_signal: GPIO_DISP_B2_08, label: ENET_QOS_CRS_DV, identifier: ENET_QOS_CRS_DV}
- {pin_num: A9, pin_signal: GPIO_DISP_B2_06, label: ENET_QOS_RXD0, identifier: ENET_QOS_RXD0}
- {pin_num: B8, pin_signal: GPIO_DISP_B2_07, label: ENET_QOS_RXD1, identifier: ENET_QOS_RXD1}
- {pin_num: C13, pin_signal: GPIO_DISP_B2_09, label: ENET_QOS_RXER, identifier: ENET_QOS_RXER}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 * 
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 * 
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void) {
    BOARD_InitPins();
    BOARD_InitDEBUG_UARTPins();
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list: []
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void) {
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitDEBUG_UARTPins:
- options: {createDeInit: 'true', callFromInitBoot: 'true', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: T19, peripheral: LPUART1, signal: TXD, pin_signal: GPIO_AD_24, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper,
    open_drain: Disable, drive_strength: High, slew_rate: Fast}
  - {pin_num: T18, peripheral: LPUART1, signal: RXD, pin_signal: GPIO_AD_25, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Keeper,
    open_drain: Disable, drive_strength: High, slew_rate: Fast}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitDEBUG_UARTPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitDEBUG_UARTPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_24_LPUART1_TXD,          /* GPIO_AD_24 is configured as LPUART1_TXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_25_LPUART1_RXD,          /* GPIO_AD_25 is configured as LPUART1_RXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_24_LPUART1_TXD,          /* GPIO_AD_24 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Disable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_25_LPUART1_RXD,          /* GPIO_AD_25 PAD functional properties : */
      0x02U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Disable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
}

