nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1152/wifi_examples/uart_wifi_bridge/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitENET_QOSPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: U3, peripheral: ENET_1G, signal: enet_mdio, pin_signal: GPIO_EMC_B1_41, pull_down_pull_up_config: No_Pull}
  - {pin_num: V2, peripheral: ENET_1G, signal: enet_mdc, pin_signal: GPIO_EMC_B1_40, pull_down_pull_up_config: No_Pull}
  - {pin_num: A11, peripheral: ENET_QOS, signal: enet_tx_en, pin_signal: GPIO_DISP_B2_04}
  - {pin_num: AE7, peripheral: ENET_QOS, signal: enet_ref_clk, pin_signal: GPIO_EMC_B2_20, direction: OUTPUT}
  - {pin_num: C15, peripheral: ENET_QOS, signal: 'enet_tdata, 00', pin_signal: GPIO_DISP_B2_02}
  - {pin_num: F11, peripheral: ENET_QOS, signal: 'enet_tdata, 01', pin_signal: GPIO_DISP_B2_03}
  - {pin_num: C9, peripheral: ENET_QOS, signal: enet_rx_en, pin_signal: GPIO_DISP_B2_08}
  - {pin_num: A9, peripheral: ENET_QOS, signal: 'enet_rdata, 00', pin_signal: GPIO_DISP_B2_06}
  - {pin_num: B8, peripheral: ENET_QOS, signal: 'enet_rdata, 01', pin_signal: GPIO_DISP_B2_07}
  - {pin_num: C13, peripheral: ENET_QOS, signal: enet_rx_er, pin_signal: GPIO_DISP_B2_09}
  - {pin_num: G11, peripheral: GPIO11, signal: 'gpio_io, 12', pin_signal: GPIO_DISP_B2_11, direction: INPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitENET_QOSPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitENET_QOSPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  /* GPIO configuration of ENET_QOS_INT_B on GPIO_DISP_B2_11 (pin G11) */
  gpio_pin_config_t ENET_QOS_INT_B_config = {
      .direction = kGPIO_DigitalInput,
      .outputLogic = 0U,
      .interruptMode = kGPIO_NoIntmode
  };
  /* Initialize GPIO functionality on GPIO_DISP_B2_11 (pin G11) */
  GPIO_PinInit(GPIO11, 12U, &ENET_QOS_INT_B_config);

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_02_ENET_QOS_TX_DATA00,  /* GPIO_DISP_B2_02 is configured as ENET_QOS_TX_DATA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_03_ENET_QOS_TX_DATA01,  /* GPIO_DISP_B2_03 is configured as ENET_QOS_TX_DATA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_04_ENET_QOS_TX_EN,  /* GPIO_DISP_B2_04 is configured as ENET_QOS_TX_EN */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_06_ENET_QOS_RX_DATA00,  /* GPIO_DISP_B2_06 is configured as ENET_QOS_RX_DATA00 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_07_ENET_QOS_RX_DATA01,  /* GPIO_DISP_B2_07 is configured as ENET_QOS_RX_DATA01 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_08_ENET_QOS_RX_EN,  /* GPIO_DISP_B2_08 is configured as ENET_QOS_RX_EN */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_09_ENET_QOS_RX_ER,  /* GPIO_DISP_B2_09 is configured as ENET_QOS_RX_ER */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_DISP_B2_11_GPIO11_IO12,     /* GPIO_DISP_B2_11 is configured as GPIO11_IO12 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_40_ENET_1G_MDC,      /* GPIO_EMC_B1_40 is configured as ENET_1G_MDC */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_41_ENET_1G_MDIO,     /* GPIO_EMC_B1_41 is configured as ENET_1G_MDIO */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B2_20_ENET_QOS_REF_CLK,  /* GPIO_EMC_B2_20 is configured as ENET_QOS_REF_CLK */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_GPR->GPR6 = ((IOMUXC_GPR->GPR6 &
    (~(IOMUXC_GPR_GPR6_ENET_QOS_REF_CLK_DIR_MASK))) /* Mask bits to zero which are setting */
      | IOMUXC_GPR_GPR6_ENET_QOS_REF_CLK_DIR(0x01U) /* ENET_QOS_REF_CLK direction control: 0x01U */
    );
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_40_ENET_1G_MDC,      /* GPIO_EMC_B1_40 PAD functional properties : */
      0x0CU);                                 /* PDRV Field: high drive strength
                                                 Pull Down Pull Up Field: No Pull
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_EMC_B1_41_ENET_1G_MDIO,     /* GPIO_EMC_B1_41 PAD functional properties : */
      0x0CU);                                 /* PDRV Field: high drive strength
                                                 Pull Down Pull Up Field: No Pull
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
}

