nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmimxrt1152/wifi_examples/uart_wifi_bridge/pin_mux.c
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitALT_UARTPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: N23, peripheral: LPUART3, signal: TXD, pin_signal: GPIO_AD_30}
  - {pin_num: M24, peripheral: LPUART3, signal: RXD, pin_signal: GPIO_AD_31}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitALT_UARTPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitALT_UARTPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_30_LPUART3_TXD,          /* GPIO_AD_30 is configured as LPUART3_TXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_31_LPUART3_RXD,          /* GPIO_AD_31 is configured as LPUART3_RXD */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPWMPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: G1, peripheral: PWM4, signal: 'A, 0', pin_signal: GPIO_EMC_B1_00}
  - {pin_num: H2, peripheral: PWM4, signal: 'B, 0', pin_signal: GPIO_EMC_B1_01}
  - {pin_num: K7, peripheral: PWM4, signal: 'A, 1', pin_signal: GPIO_EMC_B1_02}
  - {pin_num: L3, peripheral: PWM4, signal: 'A, 2', pin_signal: GPIO_EMC_B1_04}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPWMPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPWMPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_00_FLEXPWM4_PWM0_A,  /* GPIO_EMC_B1_00 is configured as FLEXPWM4_PWM0_A */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_01_FLEXPWM4_PWM0_B,  /* GPIO_EMC_B1_01 is configured as FLEXPWM4_PWM0_B */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_02_FLEXPWM4_PWM1_A,  /* GPIO_EMC_B1_02 is configured as FLEXPWM4_PWM1_A */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_EMC_B1_04_FLEXPWM4_PWM2_A,  /* GPIO_EMC_B1_04 is configured as FLEXPWM4_PWM2_A */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
}

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitQTMRPins:
- options: {callFromInitBoot: 'false', coreID: cm7, enableClock: 'true'}
- pin_list:
  - {pin_num: U23, peripheral: TMR4, signal: 'TIMER, 0', pin_signal: GPIO_AD_04, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Pull,
    open_drain: Disable, drive_strength: High, slew_rate: Fast}
  - {pin_num: V19, peripheral: TMR4, signal: 'TIMER, 1', pin_signal: GPIO_AD_05, software_input_on: Disable, pull_up_down_config: Pull_Down, pull_keeper_select: Pull,
    open_drain: Disable, drive_strength: High, slew_rate: Fast}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitQTMRPins, assigned for the Cortex-M7F core.
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitQTMRPins(void) {
  CLOCK_EnableClock(kCLOCK_Iomuxc);           /* LPCG on: LPCG is ON. */

  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_04_TMR4_TIMER0,          /* GPIO_AD_04 is configured as TMR4_TIMER0 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_SetPinMux(
      IOMUXC_GPIO_AD_05_TMR4_TIMER1,          /* GPIO_AD_05 is configured as TMR4_TIMER1 */
      0U);                                    /* Software Input On Field: Input Path is determined by functionality */
  IOMUXC_GPR->GPR15 = ((IOMUXC_GPR->GPR15 &
    (~(IOMUXC_GPR_GPR15_QTIMER4_TRM0_INPUT_SEL_MASK | IOMUXC_GPR_GPR15_QTIMER4_TRM1_INPUT_SEL_MASK))) /* Mask bits to zero which are setting */
      | IOMUXC_GPR_GPR15_QTIMER4_TRM0_INPUT_SEL(0x00U) /* QTIMER4 TMR0 input select: 0x00U */
      | IOMUXC_GPR_GPR15_QTIMER4_TRM1_INPUT_SEL(0x00U) /* QTIMER4 TMR1 input select: 0x00U */
    );
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_04_TMR4_TIMER0,          /* GPIO_AD_04 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
  IOMUXC_SetPinConfig(
      IOMUXC_GPIO_AD_05_TMR4_TIMER1,          /* GPIO_AD_05 PAD functional properties : */
      0x06U);                                 /* Slew Rate Field: Fast Slew Rate
                                                 Drive Strength Field: high drive strength
                                                 Pull / Keep Select Field: Pull Enable
                                                 Pull Up / Down Config. Field: Weak pull down
                                                 Open Drain Field: Disabled
                                                 Domain write protection: Both cores are allowed
                                                 Domain write protection lock: Neither of DWP bits is locked */
}

